nc: 1

backbone:
  - [-1, 1, Conv, [16, 3, 2]]        # 0
  - [-1, 1, Conv, [32, 3, 2]]        # 1
  - [-1, 1, C2f, [32, True]]         # 2
  - [-1, 1, Conv, [64, 3, 2]]        # 3
  - [-1, 2, C2f, [64, True]]         # 4   P3
  - [-1, 1, Conv, [128, 3, 2]]       # 5
  - [-1, 2, C2f, [128, True]]        # 6   P4
  - [-1, 1, Conv, [256, 3, 2]]       # 7
  - [-1, 1, C2f, [256, True]]        # 8   P5
  - [-1, 1, SPPF, [256, 5]]          # 9   P5/SPPF

head:
  - [4, 1, RCFP, [64]]               # 10  P3
  - [6, 1, RCFP, [128]]              # 11  P4
  - [9, 1, RCFP, [256]]              # 12  P5

  - [12, 1, nn.Upsample, [None, 2, 'nearest']]   # 13
  - [[13, 11], 1, Concat, [1]]                   # 14
  - [-1, 1, C2f, [128]]                          # 15

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   # 16
  - [[-1, 10], 1, Concat, [1]]                   # 17
  - [-1, 1, C2f, [64]]                           # 18

  - [-1, 1, Conv, [64, 3, 2]]                    # 19
  - [[-1, 15], 1, Concat, [1]]                   # 20
  - [-1, 1, C2f, [128]]                          # 21

  - [-1, 1, Conv, [128, 3, 2]]                   # 22
  - [[-1, 12], 1, Concat, [1]]                   # 23
  - [-1, 1, C2f, [256]]                          # 24

  - [[18, 21, 24], 1, PCR_Head, [nc, 1, 2, True, True, False]]